// Задание 1

var tempC = prompt("Введите температуру в градусах цельсия");
var temcF = tempC * 1.8;
alert("Температура по фарингейту составит " + temcF + " градусов");

// Задание 2

var a = prompt("Введите значение переменной \"а\"");
var b = prompt("Введите значение переменной \"b\"");
[a, b] = [b, a];
alert("После обмена данными в переменных\n\"a\" = " + a + "\n\"b\" = " + b);

// Задание 3

var name_user = "Василий";
var admin = name_user;
alert("Значение переменной admin - " + admin);


// Задание 4
var c = 1000 + "108";
alert("JS-выражение 1000 + \"108\" = " + c);

